trade_exp/src/Documents/Пропуск/Пропуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="40c6e6cf-b72f-4a58-bb30-ef44407a6c36">
  <name>Пропуск</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="caf247e2-4077-447f-b4fc-57f2b91b3323">
    <name>Доступ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12cf2cfc-6806-4e64-a645-8eae5aba9e37">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba331897-fef1-466b-a64b-e88432d8bfed">
    <name>ТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c82a20e8-4ecc-4edf-9443-2a129787f88d">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e07e4292-e551-4bc1-881d-20c85b4b9130">
    <name>Расшифровка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0737fcab-2209-423b-9ac2-108aeaf19802">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27a561ad-aa27-442d-be21-2caf93c2a208">
    <name>ВидТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b8b8bab6-8256-4375-8149-d48184352abe">
    <name>НаименованиеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="37f0c450-580f-4ac0-95ae-d5b9d95155fa">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44dd51fe-efa5-42f6-8f36-d29ec59c7464">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0562081-ea83-4c76-b366-04c8aa0d79a0">
    <name>ТипПрохода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d7be871-19e4-4d23-bedb-1c53b2a1a08f">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6abb30b9-96c0-4f1e-904d-30130b54f3fa">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d61bf324-c1d8-45b2-9921-23411a373306">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f37c12d-794f-4909-8515-13506af8c440">
    <name>Прекращен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3789b914-6a24-4b5d-935e-9a5357ce0cef">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9247de40-43c3-41a1-b013-2d5a9c7c42fd">
    <name>РазрешеноУстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d900407b-bf13-4559-9b94-d77a215eb1b3">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/Пропуск/Forms/ФормаСпискаСОтбором/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Если Параметры.Свойство("Доступ") Тогда
	 	ОтборЗонаДоступа = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЗонаДоступа.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Доступ");
		ОтборЗонаДоступа.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	    ОтборЗонаДоступа.ПравоеЗначение = Параметры.Доступ;
		ОтборЗонаДоступа.Использование = Истина; 
		ОтборЗонаДоступа.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ОтборДатаНачала = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаНачала.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаНачала");
	ОтборДатаНачала.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборДатаНачала.ПравоеЗначение = ТекущаяДата();
	ОтборДатаНачала.Использование = Истина; 
	ОтборДатаНачала.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ОтборДатаОкончания = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаОкончания.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
	ОтборДатаОкончания.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборДатаОкончания.ПравоеЗначение = ТекущаяДата();
	ОтборДатаОкончания.Использование = Истина; 
	ОтборДатаОкончания.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
КонецПроцедуры
